src/CF/DataProcessors/СменаОсновнойВалютыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>СменаОсновнойВалютыУчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НоваяОсновнаяВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/CF/InformationRegisters/ЗначенияНаДругихЯзыках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияНаДругихЯзыках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектБазыДанных</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбратныйПересчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/Documents/ДвиженияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ДвиженияДенег</Name>
			<BasedOn>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.РасходыТовара</xr:Item>
				<xr:Item>Document.Инвентаризации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
				<xr:Item>AccumulationRegister.Расчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВНесколькоСтрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПриход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходыТовара</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступленияТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеИВыплатаЗаработнойПлаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменВалют</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходДенег</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенегОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Платежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриходИлиРасход</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПриходРасход</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДенег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходыТовара</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступленияТовара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлиентПоставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДенег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CF/DataProcessors/СменаОсновнойВалютыУчета/Forms/Форма/Ext/Form/Module.bsl
// sza150321-2051 *
// sza141210-0136
// sza141114-1805
// sza141112-1620 :

&НаКлиенте
Процедура ВыполнитьСменуОсновнойВалюты(Команда)
	
	Если ЗначениеЗаполнено(Объект.НоваяОсновнаяВалютаУчета)
		И НЕ Объект.НоваяОсновнаяВалютаУчета = ОсновнаяВалюта Тогда
		
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выполняется смена основной валюты.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		ВыполнитьСменуОсновнойВалютыНаСервере();
		
		ОбновитьПовторноИспользуемыеЗначения();		
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСменуОсновнойВалютыНаСервере()
	
	ОсновнаяВалюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
	СтароеНаименование  = ОсновнаяВалюта.Наименование;
	СтарыйКод 			= ОсновнаяВалюта.Код;
	СтарыйКомментарий   = ОсновнаяВалюта.Комментарий;
	
	ВалютаСмены = Объект.НоваяОсновнаяВалютаУчета;
	НовоеНаименование = ВалютаСмены.Наименование;
	НовыйКод 		  = ВалютаСмены.Код;
	НовыйКомментарий  = ВалютаСмены.Комментарий;
	
	ОсновнаяВалютаОбъект = ОсновнаяВалюта.ПолучитьОбъект();
	ОсновнаяВалютаОбъект.Наименование = НовоеНаименование + "СПСИМВ";
	ОсновнаяВалютаОбъект.Код 		  = "Ц" + НовыйКод;
	ОсновнаяВалютаОбъект.Комментарий  = НовыйКомментарий;
	ОсновнаяВалютаОбъект.Записать();
	ОсновнаяВалюта = ОсновнаяВалютаОбъект.ссылка;
	
	ВалютаСменыОбъект = ВалютаСмены.ПолучитьОбъект();
	ВалютаСменыОбъект.Наименование  = СтароеНаименование;
	ВалютаСменыОбъект.Код 			= СтарыйКод;
	ВалютаСменыОбъект.Комментарий   = СтарыйКомментарий;
	ВалютаСменыОбъект.Записать();
	ВалютаСмены = ВалютаСменыОбъект.ссылка;
	
	ОсновнаяВалютаОбъект = ОсновнаяВалюта.ПолучитьОбъект();
	ОсновнаяВалютаОбъект.Наименование = НовоеНаименование;
	ОсновнаяВалютаОбъект.Код 		  = НовыйКод;
	ОсновнаяВалютаОбъект.Записать();
	
	ОсновнаяВалюта = ОсновнаяВалютаОбъект.ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияНаДругихЯзыках.ОбъектБазыДанных,
	|	ЗначенияНаДругихЯзыках.Поле,
	|	ЗначенияНаДругихЯзыках.Язык,
	|	ЗначенияНаДругихЯзыках.НаЯзыке,
	|	ВЫБОР
	|		КОГДА ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ОбъектБазыДанных
	|			ТОГДА ИСТИНА
	|		Иначе ЛОЖЬ
	|	КОНЕЦ КАК ВладелецСтарый
	|ИЗ РегистрСведений.ЗначенияНаДругихЯзыках КАК ЗначенияНаДругихЯзыках
	|ГДЕ (ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ОбъектБазыДанных
	|			ИЛИ ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ВторойОбъектБазыДанных)";
	
	Запрос.УстановитьПараметр("ОбъектБазыДанных", ОсновнаяВалюта);
	Запрос.УстановитьПараметр("ВторойОбъектБазыДанных", ВалютаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаписьРегистра = РегистрыСведений.ЗначенияНаДругихЯзыках.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ВыборкаДетальныеЗаписи);
			Если ВыборкаДетальныеЗаписи.ВладелецСтарый Тогда
				ЗаписьРегистра.ОбъектБазыДанных = ВалютаСмены;
			Иначе
				ЗаписьРегистра.ОбъектБазыДанных = ОсновнаяВалюта;
			КонецЕсли;		
			ЗаписьРегистра.Записать(ИСТИНА);
			
		КонецЦикла;			
	КонецЕсли;	
	
	Курс = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	Курс.Активность = ИСТИНА;
	Курс.Валюта 	= ОсновнаяВалюта;
	Курс.Курс 		= 1;
	Курс.Период 	= Дата(1980, 2, 25);
	Курс.ОбратныйПересчет = 1;
	Курс.Записать(ИСТИНА);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ХранилищаДенег.Ссылка,
	|	ВЫБОР КОГДА ХранилищаДенег.Валюта = &ОсновнаяВалюта
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВладелецСтарый
	|ИЗ Справочник.ХранилищаДенег КАК ХранилищаДенег
	|ГДЕ (ХранилищаДенег.Валюта = &ОсновнаяВалюта
	|			ИЛИ ХранилищаДенег.Валюта = &ВалютаСмены)
	|	И ХранилищаДенег.Предопределенный = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
	Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Если ВыборкаДетальныеЗаписи.ВладелецСтарый Тогда
				ОбъектДляСмены.Наименование = СтрЗаменить(ОбъектДляСмены.Наименование, СокрЛП(ОсновнаяВалюта), СокрЛП(ВалютаСмены)) + "*";
				ОбъектДляСмены.Валюта = ВалютаСмены;
			Иначе
				ОбъектДляСмены.Наименование = СтрЗаменить(ОбъектДляСмены.Наименование, СокрЛП(ВалютаСмены), СокрЛП(ОсновнаяВалюта));
				ОбъектДляСмены.Валюта = ОсновнаяВалюта;
			КонецЕсли;				
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	ОсновноеХранилищеДенег = ПредопределенноеЗначение("Справочник.ХранилищаДенег.ОсновнаяКассаВОсновнойВалюте").ПолучитьОбъект();
	СтароеНаименование = ОсновноеХранилищеДенег.Наименование;
	ОсновноеХранилищеДенег.Наименование = СтрЗаменить(ОбъектДляСмены.Наименование, СокрЛП(ОсновнаяВалюта), СокрЛП(ВалютаСмены));
	ОсновноеХранилищеДенег.Записать();
	
	ОсновноеХранилищеДенег 	= ОсновноеХранилищеДенег.Ссылка;
	СтароеНаименование 		= СтрЗаменить(СтароеНаименование, СокрЛП(ОсновнаяВалюта), "");
	СтароеНаименование 		= СтрЗаменить(СтароеНаименование, СокрЛП(ВалютаСмены), "");
	НаименованиеНаЗамену 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("На замену") + " " + СтароеНаименование;
	НовоеОсновноеХранилищеНаЗамену = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ХранилищаДенег.Ссылка
	|ИЗ Справочник.ХранилищаДенег КАК ХранилищаДенег
	|ГДЕ ХранилищаДенег.Валюта = &Валюта
	|	И ХранилищаДенег.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Валюта", ВалютаСмены);
	Запрос.УстановитьПараметр("Наименование", НаименованиеНаЗамену);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		НовоеОсновноеХранилищеНаЗамену = ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		НовоеОсновноеХранилищеНаЗамену = Справочники.ХранилищаДенег.СоздатьЭлемент();
		НовоеОсновноеХранилищеНаЗамену.Наименование = НаименованиеНаЗамену;
		НовоеОсновноеХранилищеНаЗамену.Валюта = ВалютаСмены;
		НовоеОсновноеХранилищеНаЗамену.Комментарий = ОсновноеХранилищеДенег.Комментарий;
		НовоеОсновноеХранилищеНаЗамену.Локация = ОсновноеХранилищеДенег.Локация;
		НовоеОсновноеХранилищеНаЗамену.МФО = ОсновноеХранилищеДенег.МФО;
		НовоеОсновноеХранилищеНаЗамену.НаименованиеБанка = ОсновноеХранилищеДенег.НаименованиеБанка;
		НовоеОсновноеХранилищеНаЗамену.НомерСчета = ОсновноеХранилищеДенег.НомерСчета;
		НовоеОсновноеХранилищеНаЗамену.Организация = ОсновноеХранилищеДенег.Организация;
		НовоеОсновноеХранилищеНаЗамену.ОтветственныйСотрудник = ОсновноеХранилищеДенег.ОтветственныйСотрудник;
		НовоеОсновноеХранилищеНаЗамену.Регион = ОсновноеХранилищеДенег.Регион;
		НовоеОсновноеХранилищеНаЗамену.ФормаОплаты = ОсновноеХранилищеДенег.ФормаОплаты;
		НовоеОсновноеХранилищеНаЗамену.ХранилищеПополнения = ОсновноеХранилищеДенег.ХранилищеПополнения;
		НовоеОсновноеХранилищеНаЗамену.Записать();
		НовоеОсновноеХранилищеНаЗамену = НовоеОсновноеХранилищеНаЗамену.Ссылка;
		
	КонецЕсли;
	
	Запрос = Новый Запрос; // партии приобретения
	Запрос.Текст = "ВЫБРАТЬ ПартииПриобретения.Ссылка,
	|	ВЫБОР
	|		КОГДА ПартииПриобретения.Валюта = &ОсновнаяВалюта
	|			ТОГДА ИСТИНА
	|		Иначе ЛОЖЬ
	|	КОНЕЦ КАК ВладелецСтарый
	|ИЗ Справочник.ПартииПриобретения КАК ПартииПриобретения
	|ГДЕ (ПартииПриобретения.Валюта = &ОсновнаяВалюта
	|			ИЛИ ПартииПриобретения.Валюта = &ВалютаСмены)";
	
	Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
	Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Если ВыборкаДетальныеЗаписи.ВладелецСтарый Тогда
				ОбъектДляСмены.Валюта = ВалютаСмены;
			Иначе
				ОбъектДляСмены.Валюта = ОсновнаяВалюта;
			КонецЕсли;				
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос; // партии приобретения табл
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПартииПриобретенияДополнительныеРасходы.Ссылка
	|ИЗ Справочник.ПартииПриобретения.ДополнительныеРасходы КАК ПартииПриобретенияДополнительныеРасходы
	|ГДЕ ПартииПриобретенияДополнительныеРасходы.Валюта = &ОсновнаяВалюта ИЛИ ПартииПриобретенияДополнительныеРасходы.Валюта = &ВалютаСмены";
	
	Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
	Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаОбъектаДляСмены Из ОбъектДляСмены.ДополнительныеРасходы Цикл
				Если СтрокаОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
					СтрокаОбъектаДляСмены.Валюта = ВалютаСмены;
				ИначеЕсли СтрокаОбъектаДляСмены.Валюта = ВалютаСмены Тогда
					СтрокаОбъектаДляСмены.Валюта = ОсновнаяВалюта;
				КонецЕсли;
			КонецЦикла;
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос; // сотр зарпл табл
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СотрудникиРасчетЗарплаты.Ссылка
	|ИЗ Справочник.Сотрудники.РасчетЗарплаты КАК СотрудникиРасчетЗарплаты
	|ГДЕ (СотрудникиРасчетЗарплаты.Валюта = &ОсновнаяВалюта ИЛИ СотрудникиРасчетЗарплаты.Валюта = &ВалютаСмены)";
	
	Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
	Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаОбъектаДляСмены Из ОбъектДляСмены.РасчетЗарплаты Цикл
				Если СтрокаОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
					СтрокаОбъектаДляСмены.Валюта = ВалютаСмены;
				ИначеЕсли СтрокаОбъектаДляСмены.Валюта = ВалютаСмены Тогда
					СтрокаОбъектаДляСмены.Валюта = ОсновнаяВалюта;
				КонецЕсли;
			КонецЦикла;
			
			Если ОбъектДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
				ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
			КонецЕсли;
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос; // спецификации табл
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СпецификацииДополнительныеРасходы.Ссылка
	|ИЗ Справочник.Спецификации.ДополнительныеРасходы КАК СпецификацииДополнительныеРасходы
	|ГДЕ (СпецификацииДополнительныеРасходы.Валюта = &ОсновнаяВалюта ИЛИ СпецификацииДополнительныеРасходы.Валюта = &ВалютаСмены)";
	
	Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
	Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаОбъектаДляСмены Из ОбъектДляСмены.ДополнительныеРасходы Цикл
				Если СтрокаОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
					СтрокаОбъектаДляСмены.Валюта = ВалютаСмены;
				ИначеЕсли СтрокаОбъектаДляСмены.Валюта = ВалютаСмены Тогда
					СтрокаОбъектаДляСмены.Валюта = ОсновнаяВалюта;
				КонецЕсли;
			КонецЦикла;
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПеревернутьВсеЗначенияУстановленныхКурсов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ КурсыВалют.Период,
		|	КурсыВалют.Валюта,
		|	КурсыВалют.Курс,
		|	ВЫРАЗИТЬ(КурсыВалют.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		|	КурсыВалют.Ответственный,
		|	КурсыВалют.ДатаСоздания,
		|	КурсыВалют.ДатаРедакции,
		|	ВЫБОР
		|		КОГДА КурсыВалют.Валюта = &ОсновнаяВалюта
		|			ТОГДА 1
		|		Иначе ВЫБОР
		|				КОГДА КурсыВалют.Валюта = &ВалютаСмены
		|					ТОГДА 2
		|				Иначе 0
		|			КОНЕЦ
		|	КОНЕЦ КАК ВладелецСтарый
		|ИЗ РегистрСведений.КурсыВалют КАК КурсыВалют";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();		
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВалютыКЗаменеКурса = "";
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ВыборкаДетальныеЗаписи.ВладелецСтарый = 2 Тогда
					ЗаписьРегистра = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ВыборкаДетальныеЗаписи);
					ЗаписьРегистра.Курс = ?(ЗаписьРегистра.Курс = 0, 0, 1 / ЗаписьРегистра.Курс);
					ЗаписьРегистра.ОбратныйПересчет = 1 / ?(ЗаписьРегистра.Курс = 0, 1, ЗаписьРегистра.Курс);
					ЗаписьРегистра.Записать(ИСТИНА);
					
				Иначе // курсы прочих валют вычищены в 1
					ЗаписьРегистра = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ВыборкаДетальныеЗаписи);
					ЗаписьРегистра.Курс = 1;
					ЗаписьРегистра.ОбратныйПересчет = 1;
					ЗаписьРегистра.Записать(ИСТИНА);
					
					ВалютыКЗаменеКурса = ВалютыКЗаменеКурса + " " + ВыборкаДетальныеЗаписи.Валюта;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(ВалютыКЗаменеКурса) Тогда
				ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Курсы некоторых валют утеряны") + ": " + ВалютыКЗаменеКурса);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	Если СменитьКонстанты Тогда
		ПоказыватьСуммуРасходногоДокументаТакжеВВалюте = Константы.ПоказыватьСуммуРасходногоДокументаТакжеВВалюте.Получить();
		Если ПоказыватьСуммуРасходногоДокументаТакжеВВалюте = ОсновнаяВалюта  Тогда
			Константы.ПоказыватьСуммуРасходногоДокументаТакжеВВалюте.Установить(ВалютаСмены);
		ИначеЕсли ПоказыватьСуммуРасходногоДокументаТакжеВВалюте = ВалютаСмены  Тогда
			Константы.ПоказыватьСуммуРасходногоДокументаТакжеВВалюте.Установить(ОсновнаяВалюта);
		КонецЕсли;
	КонецЕсли;
	
	Если СменитьВидыЦен Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ВидыЦен.Ссылка,
		|	ВЫБОР
		|		КОГДА ВидыЦен.ВалютаЦены = &ОсновнаяВалюта
		|			ТОГДА ИСТИНА
		|		Иначе ЛОЖЬ
		|	КОНЕЦ КАК ВладелецСтарый
		|ИЗ Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ ВидыЦен.ВалютаЦены = &ОсновнаяВалюта
		|	ИЛИ ВидыЦен.ВалютаЦены = &ВалютаСмены";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если ВыборкаДетальныеЗаписи.ВладелецСтарый Тогда
					ОбъектДляСмены.ВалютаЦены = ВалютаСмены;
				Иначе
					ОбъектДляСмены.ВалютаЦены = ОсновнаяВалюта;
				КонецЕсли;				
				ОбъектДляСмены.Записать();
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если СменитьОсновнуюВалютуКлиентов Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ Клиенты.Ссылка,
		|	Клиенты.ХранилищеДенег,
		|	Клиенты.ОсновнаяВалюта
		|ИЗ Справочник.Клиенты КАК Клиенты
		|ГДЕ (Клиенты.ОсновнаяВалюта = &ОсновнаяВалюта
		|			ИЛИ Клиенты.ОсновнаяВалюта = &ВалютаСмены
		|			ИЛИ Клиенты.ХранилищеДенег = &ХранилищеДенег)";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		Запрос.УстановитьПараметр("ХранилищеДенег", ОсновноеХранилищеДенег);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если ВыборкаДетальныеЗаписи.ОсновнаяВалюта = ОсновнаяВалюта Тогда
					ОбъектДляСмены.ОсновнаяВалюта = ВалютаСмены;
				ИначеЕсли ВыборкаДетальныеЗаписи.ОсновнаяВалюта = ВалютаСмены Тогда
					ОбъектДляСмены.ОсновнаяВалюта = ОсновнаяВалюта;
				КонецЕсли;				
				Если ВыборкаДетальныеЗаписи.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
					ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
				КонецЕсли;
				ОбъектДляСмены.Записать();
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если СменитьОсновнуюВалютуПоставщиков Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ Поставщики.Ссылка,
		|	Поставщики.ХранилищеДенег,
		|	Поставщики.ОсновнаяВалюта
		|ИЗ Справочник.Поставщики КАК Поставщики
		|ГДЕ (Поставщики.ОсновнаяВалюта = &ОсновнаяВалюта
		|			ИЛИ Поставщики.ОсновнаяВалюта = &ВалютаСмены
		|			ИЛИ Поставщики.ХранилищеДенег = &ХранилищеДенег)";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		Запрос.УстановитьПараметр("ХранилищеДенег", ОсновноеХранилищеДенег);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если ВыборкаДетальныеЗаписи.ОсновнаяВалюта = ОсновнаяВалюта Тогда
					ОбъектДляСмены.ОсновнаяВалюта = ВалютаСмены;
				ИначеЕсли ВыборкаДетальныеЗаписи.ОсновнаяВалюта = ВалютаСмены Тогда
					ОбъектДляСмены.ОсновнаяВалюта = ОсновнаяВалюта;
				КонецЕсли;				
				Если ВыборкаДетальныеЗаписи.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
					ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
				КонецЕсли;
				ОбъектДляСмены.Записать();
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Склады.Ссылка
	|ИЗ Справочник.Склады КАК Склады
	|ГДЕ Склады.ХранилищеДенег = &ХранилищеДенег";
	
	Запрос.УстановитьПараметр("ХранилищеДенег", ОсновноеХранилищеДенег);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ХранилищаДенег.Ссылка
	|ИЗ Справочник.ХранилищаДенег КАК ХранилищаДенег
	|ГДЕ ХранилищаДенег.ХранилищеПополнения = &ХранилищеДенег";
	
	Запрос.УстановитьПараметр("ХранилищеДенег", ОсновноеХранилищеДенег);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектДляСмены.ХранилищеПополнения = НовоеОсновноеХранилищеНаЗамену;
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Договора.Ссылка
	|ИЗ Справочник.Договора КАК Договора
	|ГДЕ Договора.ХранилищеДенег = &ХранилищеДенег";
	
	Запрос.УстановитьПараметр("ХранилищеДенег", ОсновноеХранилищеДенег);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Организации.Ссылка
	|ИЗ Справочник.Организации КАК Организации
	|ГДЕ Организации.ХранилищеДенег = &ХранилищеДенег";
	
	Запрос.УстановитьПараметр("ХранилищеДенег", ОсновноеХранилищеДенег);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Сотрудники.Ссылка
	|ИЗ Справочник.Сотрудники КАК Сотрудники
	|ГДЕ Сотрудники.ХранилищеДенег = &ХранилищеДенег";
	
	Запрос.УстановитьПараметр("ХранилищеДенег", ОсновноеХранилищеДенег);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
			ОбъектДляСмены.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если СменитьВДокументах Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ВыполненияРабот.Ссылка,
		|	ВыполненияРабот.Дата КАК Дата
		|ИЗ Документ.ВыполненияРабот КАК ВыполненияРабот
		|ГДЕ (ВыполненияРабот.Валюта = &ОсновнаяВалюта
		|			ИЛИ ВыполненияРабот.Валюта = &ВалютаСмены)
		|И ВыполненияРабот.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВыполненияРаботТовары.Ссылка,
		|	ВыполненияРаботТовары.Дата
		|ИЗ Документ.ВыполненияРабот.Товары КАК ВыполненияРаботТовары
		|ГДЕ (ВыполненияРаботТовары.Валюта = &ОсновнаяВалюта
		|			ИЛИ ВыполненияРаботТовары.Валюта = &ВалютаСмены)
		|	И (ВыполненияРаботТовары.ВалютаПлан = &ОсновнаяВалюта
		|			ИЛИ ВыполненияРаботТовары.ВалютаПлан = &ВалютаСмены)
		|	И ВыполненияРаботТовары.Ссылка.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВыполненияРаботОплаты.Ссылка,
		|	ВыполненияРаботОплаты.Дата
		|ИЗ Документ.ВыполненияРабот.Оплаты КАК ВыполненияРаботОплаты
		|ГДЕ (ВыполненияРаботОплаты.Валюта = &ОсновнаяВалюта
		|			ИЛИ ВыполненияРаботОплаты.Валюта = &ВалютаСмены)
		|	И (ВыполненияРаботОплаты.ВалютаПлан = &ОсновнаяВалюта
		|			ИЛИ ВыполненияРаботОплаты.ВалютаПлан = &ВалютаСмены)
		|	И ВыполненияРаботОплаты.Ссылка.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВыполненияРаботРасходы.Ссылка,
		|	ВыполненияРаботРасходы.Дата
		|ИЗ Документ.ВыполненияРабот.Расходы КАК ВыполненияРаботРасходы
		|ГДЕ (ВыполненияРаботРасходы.Валюта = &ОсновнаяВалюта
		|			ИЛИ ВыполненияРаботРасходы.Валюта = &ВалютаСмены)
		|	И (ВыполненияРаботРасходы.ВалютаПлан = &ОсновнаяВалюта
		|			ИЛИ ВыполненияРаботРасходы.ВалютаПлан = &ВалютаСмены)
		|	И ВыполненияРаботРасходы.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если ОбъектДляСмены.Валюта = ОсновнаяВалюта Тогда
					ОбъектДляСмены.Валюта = ВалютаСмены;
					ОбернутьПоКурсу(ОбъектДляСмены.Результат, 						ВалютаСмены, ОсновнаяВалюта, ВыборкаДетальныеЗаписи.Дата);
					ОбернутьПоКурсу(ОбъектДляСмены.РезультатПлан, 					ВалютаСмены, ОсновнаяВалюта, ВыборкаДетальныеЗаписи.Дата);
					ОбернутьПоКурсу(ОбъектДляСмены.ОценочнаяСтоимостьОбъектаРабот, 	ВалютаСмены, ОсновнаяВалюта, ВыборкаДетальныеЗаписи.Дата);
					
				ИначеЕсли ОбъектДляСмены.Валюта = ВалютаСмены Тогда
					ОбъектДляСмены.Валюта = ОсновнаяВалюта;
					ОбернутьПоКурсу(ОбъектДляСмены.Результат, 						ОсновнаяВалюта, ВалютаСмены, ВыборкаДетальныеЗаписи.Дата);
					ОбернутьПоКурсу(ОбъектДляСмены.РезультатПлан, 					ОсновнаяВалюта, ВалютаСмены, ВыборкаДетальныеЗаписи.Дата);
					ОбернутьПоКурсу(ОбъектДляСмены.ОценочнаяСтоимостьОбъектаРабот, 	ОсновнаяВалюта, ВалютаСмены, ВыборкаДетальныеЗаписи.Дата);
					
				КонецЕсли;				
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Товары Цикл
					
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					
					Если СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.КурсПлан);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.КурсПлан = 1;
					КонецЕсли;				
				КонецЦикла;				
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Оплаты Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;	
					
					Если СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.КурсПлан);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.КурсПлан = 1;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;				
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Расходы Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					
					Если СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.КурсПлан);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.ВалютаПлан = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.КурсПлан = 1;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;				
				
				Если ОбъектДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
					ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
				КонецЕсли;
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЦикла;
		КонецЕсли; 	
		
		// движения  денег
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДвиженияДенег.Ссылка,
		|	ДвиженияДенег.Дата КАК Дата
		|ИЗ Документ.ДвиженияДенег КАК ДвиженияДенег
		|ГДЕ (ДвиженияДенег.Валюта = &ОсновнаяВалюта
		|			ИЛИ ДвиженияДенег.Валюта = &ВалютаСмены)
		|	И ДвиженияДенег.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДвиженияДенегПлатежи.Ссылка,
		|	ДвиженияДенегПлатежи.Ссылка.Дата
		|ИЗ Документ.ДвиженияДенег.Платежи КАК ДвиженияДенегПлатежи
		|ГДЕ (ДвиженияДенегПлатежи.Валюта = &ОсновнаяВалюта
		|			ИЛИ ДвиженияДенегПлатежи.Валюта = &ВалютаСмены)
		|	И ДвиженияДенегПлатежи.Ссылка.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДвиженияДенегЗарплата.Ссылка,
		|	ДвиженияДенегЗарплата.Ссылка.Дата
		|ИЗ Документ.ДвиженияДенег.Зарплата КАК ДвиженияДенегЗарплата
		|ГДЕ (ДвиженияДенегЗарплата.Валюта = &ОсновнаяВалюта
		|			ИЛИ ДвиженияДенегЗарплата.Валюта = &ВалютаСмены)
		|	И ДвиженияДенегЗарплата.Ссылка.Проведен = ИСТИНА
		|	И (ДвиженияДенегЗарплата.ВалютаНачисления = &ОсновнаяВалюта
		|	ИЛИ ДвиженияДенегЗарплата.ВалютаНачисления = &ВалютаСмены)
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если ОбъектДляСмены.Валюта = ОсновнаяВалюта Тогда
					ОбъектДляСмены.Валюта = ВалютаСмены;
					ОбернутьКурс(ОбъектДляСмены.Курс);
					ОбъектДляСмены.СуммаПриход = ОбъектДляСмены.СуммаПриход * ОбъектДляСмены.Курс;
					ОбъектДляСмены.СуммаРасход = ОбъектДляСмены.СуммаРасход * ОбъектДляСмены.Курс;
					
				ИначеЕсли ОбъектДляСмены.Валюта = ВалютаСмены Тогда
					ОбъектДляСмены.Валюта = ОсновнаяВалюта;
					Курс = ?(ОбъектДляСмены.Курс = 0, 1, ОбъектДляСмены.Курс);
					ОбъектДляСмены.СуммаПриход = ОбъектДляСмены.СуммаПриход / Курс;
					ОбъектДляСмены.СуммаРасход = ОбъектДляСмены.СуммаРасход / Курс;
					ОбъектДляСмены.Курс = 1;
				КонецЕсли;				
				
				Если ОбъектДляСмены.ВалютаОбмена = ОсновнаяВалюта Тогда
					ОбъектДляСмены.ВалютаОбмена = ВалютаСмены;
					ОбернутьКурс(ОбъектДляСмены.КурсОбмена);
				ИначеЕсли ОбъектДляСмены.ВалютаОбмена = ВалютаСмены Тогда
					ОбъектДляСмены.ВалютаОбмена = ОсновнаяВалюта;
					ОбъектДляСмены.КурсОбмена = 1;
				КонецЕсли;
				
				Если ОбъектДляСмены.ВалютаПриход = ОсновнаяВалюта Тогда
					ОбъектДляСмены.ВалютаПриход = ВалютаСмены;
				ИначеЕсли ОбъектДляСмены.ВалютаПриход = ВалютаСмены Тогда
					ОбъектДляСмены.ВалютаПриход = ОсновнаяВалюта;
				КонецЕсли;				
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Платежи Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;				
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Зарплата Цикл
					КурсОбращали = ЛОЖЬ;
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
						КурсОбращали = ИСТИНА;
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					
					Если СтрокаТаблицыОбъектаДляСмены.ВалютаНачисления = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.ВалютаНачисления = ВалютаСмены;
						Если НЕ КурсОбращали Тогда
							ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
						КонецЕсли;
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.ВалютаНачисления = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.ВалютаНачисления = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;				
				
				Если ОбъектДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
					ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
				КонецЕсли;
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЦикла;
		КонецЕсли; 	
		
		// оказание услуг за время
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОказанияУслугЗаВремя.Ссылка,
		|	ОказанияУслугЗаВремя.Дата КАК Дата
		|ИЗ Документ.ОказанияУслугЗаВремя КАК ОказанияУслугЗаВремя
		|ГДЕ (ОказанияУслугЗаВремя.Валюта = &ОсновнаяВалюта
		|			ИЛИ ОказанияУслугЗаВремя.Валюта = &ВалютаСмены
		|			ИЛИ (ОказанияУслугЗаВремя.ВидЦен.ВалютаЦены = &ОсновнаяВалюта
		|				ИЛИ ОказанияУслугЗаВремя.ВидЦен.ВалютаЦены = &ВалютаСмены))
		|	И ОказанияУслугЗаВремя.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если ОбъектДляСмены.Валюта = ОсновнаяВалюта Тогда
					ОбъектДляСмены.Валюта = ВалютаСмены;
				ИначеЕсли ОбъектДляСмены.Валюта = ВалютаСмены Тогда
					ОбъектДляСмены.Валюта = ОсновнаяВалюта;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ОбъектДляСмены.ВидЦен) Тогда
					Если ОбъектДляСмены.ВидЦен.ВалютаЦены = ОсновнаяВалюта Тогда
						ОбернутьКурс(ОбъектДляСмены.Курс);
					ИначеЕсли ОбъектДляСмены.ВидЦен.ВалютаЦены = ВалютаСмены Тогда
						ОбъектДляСмены.Курс = 1;
					КонецЕсли;
				КонецЕсли;
				
				Если ОбъектДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
					ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
				КонецЕсли;
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЦикла;
		КонецЕсли; 	
		
		// инвентаризация
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Инвентаризации.Ссылка,
		|	Инвентаризации.Дата КАК Дата
		|ИЗ Документ.Инвентаризации КАК Инвентаризации
		|ГДЕ Инвентаризации.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если ОбъектДляСмены.Валюта = ОсновнаяВалюта Тогда
					ОбъектДляСмены.Валюта = ВалютаСмены;
				ИначеЕсли ОбъектДляСмены.Валюта = ВалютаСмены Тогда
					ОбъектДляСмены.Валюта = ОсновнаяВалюта;
				КонецЕсли;
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.ОтражениеВЗарплате Цикл
					ОбернутьПоКурсу(СтрокаТаблицыОбъектаДляСмены.Сумма, ОсновнаяВалюта, ВалютаСмены, ВыборкаДетальныеЗаписи.Дата);
				КонецЦикла;
				
				Если ОбъектДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
					ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
				КонецЕсли;
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	
				
			КонецЦикла;
		КонецЕсли; 	
		
		// корректировки
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КорректировкиИРегистрацияОстатковДеньги.Ссылка,
		|	КорректировкиИРегистрацияОстатковДеньги.Ссылка.Дата КАК Дата
		|ИЗ Документ.КорректировкиИРегистрацияОстатков.Деньги КАК КорректировкиИРегистрацияОстатковДеньги
		|ГДЕ (КорректировкиИРегистрацияОстатковДеньги.Валюта = &ОсновнаяВалюта
		|			ИЛИ КорректировкиИРегистрацияОстатковДеньги.Валюта = &ВалютаСмены)
		|	И КорректировкиИРегистрацияОстатковДеньги.Ссылка.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КорректировкиИРегистрацияОстатковЗарплата.Ссылка,
		|	КорректировкиИРегистрацияОстатковЗарплата.Ссылка.Дата
		|ИЗ Документ.КорректировкиИРегистрацияОстатков.Зарплата КАК КорректировкиИРегистрацияОстатковЗарплата
		|ГДЕ (КорректировкиИРегистрацияОстатковЗарплата.Валюта = &ОсновнаяВалюта
		|			ИЛИ КорректировкиИРегистрацияОстатковЗарплата.Валюта = &ВалютаСмены)
		|	И КорректировкиИРегистрацияОстатковЗарплата.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Расчеты Цикл
					ОбернутьПоКурсу(СтрокаТаблицыОбъектаДляСмены.Сумма, ОсновнаяВалюта, ВалютаСмены, ВыборкаДетальныеЗаписи.Дата);
				КонецЦикла;
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.РасчетыСПоставщиками Цикл
					ОбернутьПоКурсу(СтрокаТаблицыОбъектаДляСмены.Сумма, ОсновнаяВалюта, ВалютаСмены, ВыборкаДетальныеЗаписи.Дата);
				КонецЦикла;
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.ТоварыПереданныеНаКомиссию Цикл
					ОбернутьПоКурсу(СтрокаТаблицыОбъектаДляСмены.Цена, ОсновнаяВалюта, ВалютаСмены, ?(ЗначениеЗаполнено(СтрокаТаблицыОбъектаДляСмены.ДатаПередачиНаКомиссию), СтрокаТаблицыОбъектаДляСмены.ДатаПередачиНаКомиссию, ОбъектДляСмены.Дата));
					СтрокаТаблицыОбъектаДляСмены.Сумма = СтрокаТаблицыОбъектаДляСмены.Цена * СтрокаТаблицыОбъектаДляСмены.Количество;
				КонецЦикла;
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Деньги Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;		
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Зарплата Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
					КонецЕсли;				
				КонецЦикла;		
				
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				// 	ОбщийМодульТоварСервер.ПересчитатьТоварыНаСервере(ОбъектДляСмены);
				
			КонецЦикла;
			
		КонецЕсли; 	
		
		// перемещ
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПеремещенияТовара.Ссылка,
		|	ПеремещенияТовара.Дата КАК Дата
		|ИЗ Документ.ПеремещенияТовара КАК ПеремещенияТовара
		|ГДЕ ПеремещенияТовара.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				// ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				ОбщийМодульТоварСервер.ПересчитатьТоварыНаСервере(ВыборкаДетальныеЗаписи.Ссылка);
				
			КонецЦикла;			
		КонецЕсли; 	
		
		// поступление
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступленияТовара.Ссылка,
		|	ПоступленияТовара.Дата КАК Дата
		|ИЗ Документ.ПоступленияТовара КАК ПоступленияТовара
		|ГДЕ (ПоступленияТовара.Валюта = &ОсновнаяВалюта
		|			ИЛИ ПоступленияТовара.Валюта = &ВалютаСмены)
		|	И ПоступленияТовара.Ссылка.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступленияТовараДополнительныеРасходы.Ссылка,
		|	ПоступленияТовараДополнительныеРасходы.Ссылка.Дата
		|ИЗ Документ.ПоступленияТовара.ДополнительныеРасходы КАК ПоступленияТовараДополнительныеРасходы
		|ГДЕ (ПоступленияТовараДополнительныеРасходы.Валюта = &ОсновнаяВалюта
		|			ИЛИ ПоступленияТовараДополнительныеРасходы.Валюта = &ВалютаСмены)
		|	И ПоступленияТовараДополнительныеРасходы.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если ОбъектДляСмены.Валюта = ОсновнаяВалюта Тогда
					ОбъектДляСмены.Валюта = ВалютаСмены;
					ОбернутьКурс(ОбъектДляСмены.Курс);
					ОбъектДляСмены.ТовараНаСумму = ОбъектДляСмены.ТовараНаСумму * ОбъектДляСмены.Курс;
					
				ИначеЕсли ОбъектДляСмены.Валюта = ВалютаСмены Тогда
					ОбъектДляСмены.Валюта = ОсновнаяВалюта;
					Курс = ?(ОбъектДляСмены.Курс = 0, 1, ОбъектДляСмены.Курс);
					ОбъектДляСмены.ТовараНаСумму = ОбъектДляСмены.ТовараНаСумму / Курс;
					ОбъектДляСмены.Курс = 1;
				КонецЕсли;				
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.ДополнительныеРасходы Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;		
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.ПланОплаты Цикл
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;
				
				Если ОбъектДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
					ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
				КонецЕсли;
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЦикла;			
		КонецЕсли; 	
		
		// расходы
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасходыТовара.Ссылка,
		|	РасходыТовара.Дата КАК Дата
		|ИЗ Документ.РасходыТовара КАК РасходыТовара
		|ГДЕ (РасходыТовара.Валюта = &ОсновнаяВалюта
		|			ИЛИ РасходыТовара.Валюта = &ВалютаСмены)
		|	И РасходыТовара.Ссылка.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасходыТовараОплаты.Ссылка,
		|	РасходыТовараОплаты.Ссылка.Дата
		|ИЗ Документ.РасходыТовара.Оплаты КАК РасходыТовараОплаты
		|ГДЕ (РасходыТовараОплаты.Валюта = &ОсновнаяВалюта
		|			ИЛИ РасходыТовараОплаты.Валюта = &ВалютаСмены)
		|	И РасходыТовараОплаты.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Если ОбъектДляСмены.Валюта = ОсновнаяВалюта Тогда
					ОбъектДляСмены.Валюта = ВалютаСмены;
					ОбернутьКурс(ОбъектДляСмены.Курс);
					ОбъектДляСмены.ТовараНаСумму = ОбъектДляСмены.ТовараНаСумму * ОбъектДляСмены.Курс;
					
				ИначеЕсли ОбъектДляСмены.Валюта = ВалютаСмены Тогда
					ОбъектДляСмены.Валюта = ОсновнаяВалюта;
					Курс = ?(ОбъектДляСмены.Курс = 0, 1, ОбъектДляСмены.Курс);
					ОбъектДляСмены.ТовараНаСумму = ОбъектДляСмены.ТовараНаСумму / Курс;
					ОбъектДляСмены.Курс = 1;
				КонецЕсли;				
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Оплаты Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;		
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.ПланОплаты Цикл
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;
				
				Если ОбъектДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
					ОбъектДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
				КонецЕсли;
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЦикла;			
		КонецЕсли; 	
		
		// компл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КомплектацияДополнительныеРасходы.Ссылка,
		|	КомплектацияДополнительныеРасходы.Ссылка.Дата КАК Дата
		|ИЗ Документ.Комплектация.ДополнительныеРасходы КАК КомплектацияДополнительныеРасходы
		|ГДЕ КомплектацияДополнительныеРасходы.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
				ОбернутьПоКурсу(ОбъектДляСмены.ТовараНаСумму, ОсновнаяВалюта, ВалютаСмены, ОбъектДляСмены.Дата);
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Материалы Цикл
					ОбернутьПоКурсу(ОбъектДляСмены.Цена, ОсновнаяВалюта, ВалютаСмены, ОбъектДляСмены.Дата);
					ОбъектДляСмены.Сумма = ОбъектДляСмены.Цена * ОбъектДляСмены.Количество;
				КонецЦикла;		
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Товары Цикл
					ОбернутьПоКурсу(ОбъектДляСмены.Цена, ОсновнаяВалюта, ВалютаСмены, ОбъектДляСмены.Дата);
					ОбъектДляСмены.Сумма = ОбъектДляСмены.Цена * ОбъектДляСмены.Количество;
				КонецЦикла;	
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.ДополнительныеРасходы Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;		
				
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЦикла;			
		КонецЕсли; 	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтчетыКомиссионеровДеньгиЗаТовар.Ссылка,
		|	ОтчетыКомиссионеровДеньгиЗаТовар.Ссылка.Дата КАК Дата
		|ИЗ Документ.ОтчетыКомиссионеров.ДеньгиЗаТовар КАК ОтчетыКомиссионеровДеньгиЗаТовар
		|ГДЕ (ОтчетыКомиссионеровДеньгиЗаТовар.Валюта = &ОсновнаяВалюта
		|			ИЛИ ОтчетыКомиссионеровДеньгиЗаТовар.Валюта = &ВалютаСмены)
		|	И ОтчетыКомиссионеровДеньгиЗаТовар.Ссылка.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтчетыКомиссионеровКомиссионноеВознаграждение.Ссылка,
		|	ОтчетыКомиссионеровКомиссионноеВознаграждение.Ссылка.Дата
		|ИЗ Документ.ОтчетыКомиссионеров.КомиссионноеВознаграждение КАК ОтчетыКомиссионеровКомиссионноеВознаграждение
		|ГДЕ (ОтчетыКомиссионеровКомиссионноеВознаграждение.Валюта = &ОсновнаяВалюта
		|			ИЛИ ОтчетыКомиссионеровКомиссионноеВознаграждение.Валюта = &ВалютаСмены)
		|	И ОтчетыКомиссионеровКомиссионноеВознаграждение.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.ДеньгиЗаТовар Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;		
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.КомиссионноеВознаграждение Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
					Если СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = ОсновноеХранилищеДенег Тогда
						СтрокаТаблицыОбъектаДляСмены.ХранилищеДенег = НовоеОсновноеХранилищеНаЗамену;
					КонецЕсли;
				КонецЦикла;		
				
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЦикла;			
		КонецЕсли; 	
		
		// планы доходов и расходов
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланыДоходовИРасходовДенегПланРасхода.Ссылка,
		|	ПланыДоходовИРасходовДенегПланРасхода.Ссылка.Дата КАК Дата
		|ИЗ Документ.ПланыДоходовИРасходовДенег.ПланРасхода КАК ПланыДоходовИРасходовДенегПланРасхода
		|ГДЕ (ПланыДоходовИРасходовДенегПланРасхода.Валюта = &ОсновнаяВалюта
		|			ИЛИ ПланыДоходовИРасходовДенегПланРасхода.Валюта = &ВалютаСмены)
		|	И ПланыДоходовИРасходовДенегПланРасхода.Ссылка.Проведен = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланыДоходовИРасходовДенегПланДохода.Ссылка,
		|	ПланыДоходовИРасходовДенегПланДохода.Ссылка.Дата
		|ИЗ Документ.ПланыДоходовИРасходовДенег.ПланДохода КАК ПланыДоходовИРасходовДенегПланДохода
		|ГДЕ (ПланыДоходовИРасходовДенегПланДохода.Валюта = &ОсновнаяВалюта
		|			ИЛИ ПланыДоходовИРасходовДенегПланДохода.Валюта = &ВалютаСмены)
		|	И ПланыДоходовИРасходовДенегПланДохода.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.ПланРасхода Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
				КонецЦикла;		
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.ПланДохода Цикл
					Если СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены;
						ОбернутьКурс(СтрокаТаблицыОбъектаДляСмены.Курс);
					ИначеЕсли СтрокаТаблицыОбъектаДляСмены.Валюта = ВалютаСмены Тогда
						СтрокаТаблицыОбъектаДляСмены.Валюта = ОсновнаяВалюта;
						СтрокаТаблицыОбъектаДляСмены.Курс = 1;
					КонецЕсли;				
				КонецЦикла;		
				
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЦикла;			
		КонецЕсли; 		
		
		// планы продаж
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланыПродаж.Ссылка,
		|	ПланыПродаж.Ссылка.Дата КАК Дата
		|ИЗ Документ.ПланыПродаж КАК ПланыПродаж
		|ГДЕ ПланыПродаж.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО Дата";
		
		Запрос.УстановитьПараметр("ОсновнаяВалюта", ОсновнаяВалюта);
		Запрос.УстановитьПараметр("ВалютаСмены", ВалютаСмены);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбъектДляСмены = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				
				ОбернутьПоКурсу(ОбъектДляСмены.ТовараНаСумму, ОсновнаяВалюта, ВалютаСмены, ОбъектДляСмены.ДатаНачала);
				
				Для Каждого СтрокаТаблицыОбъектаДляСмены Из ОбъектДляСмены.Товары Цикл
					ОбернутьПоКурсу(СтрокаТаблицыОбъектаДляСмены.Сумма, ОсновнаяВалюта, ВалютаСмены, ОбъектДляСмены.ДатаНачала);
				КонецЦикла;		
				
				ОбъектДляСмены.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
			КонецЦикла;			
		КонецЕсли; 		
		
		ОбщийМодульСерверПривилегия.ПерепровестиВсеДокументыВБазеДанных();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбернутьКурс(Курс)
	Курс = ?(Курс = 0, 0, 1 / Курс);
КонецПроцедуры

Процедура ОбернутьПоКурсу(ЗначениеДляОборота, Знач ВВалюту, Знач ИзВалюты, Знач НаДату)	
	ЗначениеДляОборота = ОбщийМодульСервер.ПоКурсу(ЗначениеДляОборота, ВВалюту, ИзВалюты, НаДату);	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000950", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ТекущаяОсновнаяВалюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
		
		ВестиУчетДенегВНесколькихХранилищах = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетДенегВНесколькихХранилищах");
		Элементы.ВместоОсновногоХранилищаДенегБудетСозданоНовоеХранилищеНаЗамену.Видимость = ВестиУчетДенегВНесколькихХранилищах;
		
		СменитьКонстанты = ИСТИНА;
		ПеревернутьВсеЗначенияУстановленныхКурсов = ИСТИНА;
		СменитьВидыЦен = ИСТИНА;
		СменитьВДокументах = ИСТИНА;
	КонецЕсли;
	
КонецПроцедуры
